In [3]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

In [4]:
%%sql
SELECT * FROM sqlite_master WHERE type='table';

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [5]:
%%sql 
SELECT * 
FROM facts 
LIMIT 5

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [14]:
%%sql
SELECT MIN(population) 'Min pop', MAX(population) 'Max pop', MIN(population_growth) 'Min pop gr', MAX(population_growth) 
FROM facts;

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

In [17]:
%%sql
SELECT *
FROM facts 
WHERE population = (SELECT MIN(population) FROM facts)

 * sqlite:///factbook.db
Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]

In [19]:
%%sql
SELECT AVG(population) avg_pop, AVG(area) avg_area
FROM facts

 * sqlite:///factbook.db
Done.

[(62094928.32231405, 555093.546184739)]

In [24]:
%%sql
SELECT name 'Countries with above average pop and below avg area'
FROM facts
WHERE population > (SELECT AVG(population) FROM facts) AND area < (SELECT AVG(area) FROM facts)

 * sqlite:///factbook.db
Done.

[('Bangladesh',),
 ('Germany',),
 ('Japan',),
 ('Philippines',),
 ('Thailand',),
 ('United Kingdom',),
 ('Vietnam',)]

Which countries have the highest ratios of water to land? Which countries have more water than land?

In [28]:
%%sql
SELECT name 'Highest water to land ratio', area_water / area_land 'Ratio'
FROM facts
WHERE Ratio > 1 
ORDER BY area_water / area_land DESC

 * sqlite:///factbook.db
Done.

[('British Indian Ocean Territory', 905), ('Virgin Islands', 4)]

Which countries will add the most people to their population next year?

In [31]:
%%sql
SELECT name, (population) * (population_growth) number
FROM facts 
WHERE number = (SELECT( MAX ( (population) * (population_growth) ) )
                                FROM facts)

 * sqlite:///factbook.db
Done.

[('World', 7837009211.88)]

In [32]:
%%sql
SELECT name, (population) * (population_growth) number
FROM facts 
ORDER BY number DESC
LIMIT 2

 * sqlite:///factbook.db
Done.

[('World', 7837009211.88), ('India', 1527068612.48)]

Which countries have a higher death rate than birth rate

In [34]:
%%sql
SELECT name 
FROM facts 
WHERE birth_rate < death_rate

 * sqlite:///factbook.db
Done.

[('Austria',),
 ('Belarus',),
 ('Bosnia and Herzegovina',),
 ('Bulgaria',),
 ('Croatia',),
 ('Czech Republic',),
 ('Estonia',),
 ('Germany',),
 ('Greece',),
 ('Hungary',),
 ('Italy',),
 ('Japan',),
 ('Latvia',),
 ('Lithuania',),
 ('Moldova',),
 ('Monaco',),
 ('Poland',),
 ('Portugal',),
 ('Romania',),
 ('Russia',),
 ('Serbia',),
 ('Slovenia',),
 ('Ukraine',),
 ('Saint Pierre and Miquelon',)]